performance/pdfTest.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 1
      arrivalCount: 1
scenarios:
  - name: 'Generate PDF'
    flow:
      - log: "Get access token"
      - post:
          url: "https://keycloak.elf79.dev/auth/realms/elf/protocol/openid-connect/token"
          headers:
            Content-Type: "application/x-www-form-urlencoded"
          form:
            username: "{{ $processEnvironment.USERNAME }}"
            password: "{{ $processEnvironment.PASSWORD }}"
            grant_type: "password"
            client_id: "www"
          capture:
            json: "$.access_token"
            as: "accessToken"
      - post:
          url: "/pdf"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            {
              "submission": {
                "data": {
                  "businessKey": "BF-190909-76",
                  "firstName": "Mark",
                  "familyName": "Olliver",
                  "phoneNumber": "+447870808487",
                  "email": "mark.olliver@homeoffice.gov.uk",
                  "eventTypeId": "27",
                  "shifthistoryid": "da273d81-6e82-48e3-949d-187cbb562b32",
                  "themeModeContainer": {
                    "goodsCheck": "",
                    "peopleCheck": {
                      "peopleFound": true
                    },
                    "selectTheMode": "generalAviation"
                  },
                  "controlContainer": {
                    "print": true,
                    "HCode": "L",
                    "controlGrid": [
                    {
                      "controlStrategy": 1
                    }
                    ],
                    "adoptionCheck": {
                      "hmrc": true,
                      "nca": false,
                      "defra": false,
                      "cfi": false,
                      "other": false
                    },
                    "unadopted": "false"
                  },
                  "shiftDetailsContainer": {
                    "print": false,
                    "shiftLocation": "uk",
                    "DetectionDetails_locationName": "Heathrow",
                    "portDecDMS": "",
                    "DetectionDetails_timeDate": "2019-09-09T12:00:00",
                    "DetectionDetails_detectionNotes": ""
                  },
                  "peopleMOContainer": {
                    "print": false,
                    "peopleConcealmentFilter": "filter=air=eq.TRUE",
                    "moPeople_detectionTechRad": "yes",
                    "moPeople_Grid": [
                    {
                      "moPeople_concealmentMethod": 1
                    }
                    ],
                    "moPeople_furtherDetails": "",
                    "moPeople_detectionTechnology": 2
                  },
                  "itemMOcontainer": {
                    "print": false,
                    "itemConcealmentFilter": "filter=air=eq.TRUE"
                  },
                  "profileIndicatorContainer": {
                    "print": true,
                    "profileFilter": "",
                    "profileIndicator_prePostRad": "paO",
                    "profileIndicator_scannedRad": false,
                    "profileIndicator_furtherDetails": "",
                    "profileIndicatorGrid_notRoRo": [
                    {
                      "profileIndicator": 4
                    }
                    ]
                  },
                  "officerContainer": {
                    "print": false,
                    "OfficerDetails_ROID": "af4601db-1640-4ff2-a4cc-da44bce99226",
                    "OfficerDetails_ROName": "Mark Olliver",
                    "OfficerDetails_ROteam": "737674f3-6fc2-413e-aca3-ce06b42e4a7a",
                    "OfficerDetails_IOID": "",
                    "OfficerDetails_IOteam": "",
                    "OfficerDetails_IOemail": ""
                  },
                  "summary_ROName": "Mark Olliver",
                  "summary4": "",
                  "peopleDetectionContainer": {
                    "print": false,
                    "nationalityBreakdownGrid": [
                    {
                      "people_nationalityBd": 1,
                      "people_typeBd": 1,
                      "people_numberBd": 1
                    }
                    ],
                    "PeopleDetection_docFound": false
                  },
                  "SAMScontainer": {
                    "print": true
                  },
                  "sponsorContainer": {
                    "print": false,
                    "sponsor_company": "",
                    "sponsor_surname": "",
                    "sponsor_forename": "",
                    "sponsor_dob": "00/00/0000",
                    "sponsor_sex": "",
                    "sponsor_passportIDNum": "",
                    "sponsor_nationality": "",
                    "sponsor_addressLine1": "",
                    "sponsor_addressLine2": "",
                    "sponsor_addressLine3": "",
                    "sponsor_townCity": "",
                    "sponsor_country": "",
                    "sponsor_postcode": "",
                    "sponsor_PhoneNum": ""
                  },
                  "aviationContainer": {
                    "print": false,
                    "aviationTravelDetails_aircraftReg": "EASY",
                    "aviationTravelDetails_flightNo": "EY1",
                    "aviationTravelDetails_departureTime": "",
                    "aviationTravelDetails_departureCountry": "",
                    "aviationTravelDetails_departurePort": "",
                    "aviationTravelDetails_portDecDMSDep": "",
                    "aviationTravelDetails_arrivalTime": "",
                    "aviationTravelDetails_destinationCountry": "",
                    "aviationTravelDetails_destinationPort": "",
                    "aviationTravelDetails_portDecDMSArr": "",
                    "aviationTravelDetails_specificPortArr": "",
                    "aviationTravelDetails_legBdGrid": [
                    {
                      "aviationTravelDetails_legDepPort": "",
                      "aviationTravelDetails_legDepDate": "00/00/0000",
                      "aviationTravelDetails_legArrPort": "",
                      "aviationTravelDetails_legArrDate": "00/00/0000",
                      "aviationTravelDetails_legPayment": {}
                    }
                    ],
                    "aviationTravelDetails_aircraftType": "",
                    "aviationTravelDetails_aircraftTypeUse": "",
                    "aviationTravelDetails_brokerSchool": ""
                  },
                  "generalAviationContainer": {
                    "print": false,
                    "aviationAircraftOwner_companyName": "",
                    "aviationAircraftOwner_surname": "",
                    "aviationAircraftOwner_forename": "",
                    "aviationAircraftOwner_addressLine1": "",
                    "aviationAircraftOwner_addressLine2": "",
                    "aviationAircraftOwner_addressLine3": "",
                    "aviationAircraftOwner_townCity": "",
                    "aviationAircraftOwner_postcode": "",
                    "aviationAircraftOwner_country": {},
                    "aviationAircraftOwner_phoneNumber": ""
                  },
                  "commercialAviationContainer": {
                    "print": false
                  },
                  "aviationPassengerCrewContainer": {
                    "checkbox": false,
                    "aviationPassengerCrewGrid": [
                    {
                      "aviationPassengerCrew_crewRole": {},
                      "aviationPassengerCrew_surname": "",
                      "aviationPassengerCrew_forename": "",
                      "aviationPassengerCrew_dob": "00/00/0000",
                      "aviationPassengerCrew_sex": {},
                      "aviationPassengerCrew_passportIDNum": "",
                      "aviationPassengerCrew_nationality": {},
                      "aviationPassengerCrew_addressLine1": "",
                      "aviationPassengerCrew_addressLine2": "",
                      "aviationPassengerCrew_addressLine3": "",
                      "aviationPassengerCrew_townCity": "",
                      "aviationPassengerCrew_postcode": "",
                      "aviationPassengerCrew_country": {},
                      "aviationPassengerCrew_phoneNumber": "",
                      "aviationPassengerCrew_validVisaRad": ""
                    }
                    ]
                  },
                  "_encryptionMetaData": {
                    "iv": "ZtjS06A/hob3DSGJrS/iLQ==",
                    "publicKey": "BBlBKlQmWa58ngJoSAKQ/+ut21qUf/8RCYqIATiGaeXcfnjskyATqGT+iRVnJKohjnA9zbiq4fxIbdCQ9AknYr0Bpd1iG726ajXwWDddETHSKltqiK/KjSxE/64N3miGZ4wAm4EETtXVnQjck7d+ypVUnsLnl0np1bEMR0UKnuB8"
                  }
                }
              },
              "webhookUrl": "http://localhost:9001/webhook",
              "formUrl": "http://localhost:4000/form/89685cec-a3e0-4c8a-be7c-b3e7aab53290"
            }