performance/perfGetFormTest.yml
config:
  target: '{{ $processEnvironment.FORM_API_SERVER_URL }}'
  phases:
    - duration: 120
      arrivalRate: 100
scenarios:
  - name: 'Get a form'
    flow:
      - log: "Get a specific form"
      - get:
          url: "/form/ba5cfe58-a256-45d2-9eb5-c16f488e6f60"
          headers:
            Authorization: "Bearer {{ $processEnvironment.ACCESS_TOKEN }}"